---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsInsulationThicknessForPipe
source: html/dcd264d2-4244-2479-b935-eeb3aacd8c1d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsInsulationThicknessForPipe Property

"Insulation Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsInsulationThicknessForPipe { get; }
```